# Напишите программу, которая найдёт произведение пар чисел списка. 
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.

list = [1,2,4,5,6,10,11]
a = 0
b = len(list)
list2 = []
if b%2 == 0:
    len2 = b//2
else:
    len2 = b//2 + 1

while len2 > 0:
    list2.insert(a,list[a]*list[b-1]) 
    a+=1
    b-=1
    len2-=1
print(list2)
